app/views/posts/_form.html.erb

SELECT "categories".* FROM "categories"
---
    <%= f.label :category_id %>
    <%= f.select :category_id, Category.all.map { |c| [c.name, c.id] } , class: "form-control" %>