app/controllers/categories_controller.rb

  def create
    @category = Category.new(category_params)
    @category.save
---
INSERT INTO "categories" ("name") VALUES (?)  [["name", "Category 1"]]

  def update
    load_category
    @category.update(category_params)
---
UPDATE "categories" SET "name" = ? WHERE "categories"."id" = ?  [["name", "kekosik"], ["id", 1]]

  def delete
    load_category
    @category.destroy
---
DELETE FROM "categories" WHERE "categories"."id" = ?  [["id", 2]]

  def load_category
    @category = Category.find(params[:category_id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]