app/controllers/posts_controller.rb

  def index
    @posts = Post.all
---
SELECT "posts".* FROM "posts" ORDER BY "posts"."id" DESC

  def filter
    @category = Category.find( params[:category_id])
    @posts = Post.where(category_id: params[:category_id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."category_id" = ?  [["category_id", 1]]

  def create
    @post = Post.new(post_params)
    @post.save
---
INSERT INTO "posts" ("title", "text", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Post 1"], ["text", "Some text"], ["category_id", 3], ["created_at", "2020-05-31 13:30:10.701112"], ["updated_at", "2020-05-31 13:30:10.701112"]]

  def update
    load_post
    @post.update(post_params)
---
UPDATE "posts" SET "title" = ?, "text" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "Post 1"], ["text", "kek\r\n"], ["updated_at", "2020-05-31 13:28:54.092186"], ["id", 2]]

  def delete
    load_post
    @post.destroy
---
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 2]]

  def load_post
    @post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]